[
  {
    "type": "bible",
    "quote": "\"He said to them, 'You are the ones who justify yourselves in the eyes of others, but God knows your hearts. What people value highly is detestable in God's sight.'\"",
    "verse": "Luke 16:15 NIV",
    "verseLink": "https://www.biblegateway.com/passage/?search=Luke%2016:15&version=NIV"
  },
  {
    "type": "p",
    "text": "I relied on my own strength, believing that my judgments, decisions, and reasoning were correct and moral, as I only believed in myself."
  },
  {
    "type": "p",
    "text": "Despite my own strength and morals, I stumbled time and time again. I was toxic and selfish, prioritizing myself over others. I took pride in being better than others and never fully accepted their opinions, growing envious of those who had talents or things I didn't possess. I was completely absorbed with myself."
  },
  {
    "type": "p",
    "text": "I started questioning the existence of God. I was angry with Him, never fully understanding the lack of purpose and the hatred I felt towards others and myself in life. It seemed as though my prayers were never answered."
  },
  {
    "type": "p",
    "text": "Gradually, I descended lower and lower into the depths of despair, with the pressure making it harder and harder for me to withstand. Though I struggled and attempted to rise above, I only sank further and further."
  },
  {
    "type": "p",
    "text": "My downward spiral toward worldly desires led me to lose my friends due to my selfish and immoral decisions. I flunked out of high school because of my own self-indulgence and self-imposed laziness. My family was disappointed in me for failing my schooling. I amounted to nothing in the eyes of the world. I had hit rock bottom."
  },
  {
    "type": "p",
    "text": "In a desperate attempt to be heard and confide in someone, I turned to the Lord whom I had long ignored and brushed aside. I don't remember exactly what I prayed to Him, but I remember saying:"
  },
  {
    "type": "quote",
    "quote": "\"Dear Heavenly Father, it's been a while since I've last spoken to you. Lord, I am a sinner. I have strayed so far from the path. I've ignored and pushed you away for so long. I have put everything under my own power, however I realize that I am too weak for it. I ask for you to take control of my life. Please Lord, I beg of you to see one of your signs that you exist. If I see one of your signs, I will forever be indebted and will sacrifice my life to you.\""
  },
  {
    "type": "p",
    "text": "It wasn't perfect, nor was it a textbook example of a sinner's prayer, but I was sincere and showed my vulnerability and weakness to God."
  },
  {
    "type": "bible",
    "quote": "\"And God, who knows the heart, bore witness to them, by giving them the Holy Spirit just as he did to us, and he made no distinction between us and them, having cleansed their hearts by faith.\"",
    "verse": "Acts 15:8-9 NIV",
    "verseLink": "https://www.biblegateway.com/passage/?search=Acts%2015:8-9&version=NIV"
  },
  {
    "type": "p",
    "text": "Admittedly, at the beginning, I didn't read Scripture, but I prayed and listened to the Lord, prioritizing the removal of all the toxins that surrounded me."
  },
  {
    "type": "p",
    "text": "I returned to church, but this time it was for my own healing and improvement, not just because my parents told me to go. I was sincere in my efforts and focused solely on Him. I didn't worry about where I was going or my worth compared to society. I wanted to get better in the eyes of the Lord."
  },
  {
    "type": "p",
    "text": "Currently, I am in the process of sincerely learning what it means to be a Christian and sharing my journey in Christ."
  },
  {
    "type": "question",
    "text": "\"Why must I tell you all of this? Why do I share my failures and rejections toward Christ?\""
  },
  {
    "type": "break"
  },
  {
    "type": "answer",
    "text": "Because I am not a perfect person."
  },
  {
    "type": "p",
    "text": "I am an imperfect man. I have my temptations, my flaws, and my weaknesses. I've had issues with drinking and drugs, with my actions leading to very regrettable consequences. I continually suffer from self-deprecation. I have harmed others for my own benefit, constantly placing myself above others."
  },
  {
    "type": "p",
    "text": "Being an imperfect person, I am susceptible to the temptations presented to many people in my daily life. However, with this, I am able to spread the message of the Lord to the greater masses, to everyday people like myself who stumble and fall by their own toils. I humbly ask to be heard, despite my shortcomings."
  },
  {
    "type": "bibleBig",
    "quote": "\"Whoever has ears, let them hear.\"",
    "verse": "Matthew 13:9 NIV",
    "verseLink": "https://www.biblegateway.com/passage/?search=Matthew%2013:9&version=NIV"
  }
]
